src/app/controllers/experiences_controller.rb

  def index

    if params[:search]
    @experiences = Experience.search(params[:search]).order("created_at DESC")
  else
    @experiences = Experience.all.order(params[:sort])
---
SELECT "experiences".* FROM "experiences"

  def show
    @experience= Experience.find(params[:id])
---
SELECT  "experiences".* FROM "experiences" WHERE "experiences"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create
    @experience = Experience.new(experience_params)
    count = 0;
    respond_to do |format|
      if @experience.save
---
INSERT INTO "experiences" ("title", "content", "location", "rating", "user_id", "category_id", "tag_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"

  def update
    respond_to do |format|
      if @experience.update(experience_params)
---
UPDATE "experiences" SET "category_id" = $1, "tag_id" = $2, "updated_at" = $3 WHERE "experiences"."id" = $4  [["category_id", 5], ["tag_id", 4], ["updated_at", 2016-11-20 09:01:50 UTC], ["id", 1]]

    def set_experience
      @experience = Experience.find(params[:id])
---
SELECT  "experiences".* FROM "experiences" WHERE "experiences"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]