src/app/controllers/friendships_controller.rb

SELECT "users".* FROM "users" WHERE ((id not in (4)) and (id != 1)) AND (email like '%hung%')
---
  def new
    if params[:is_facebook].present? && params[:is_facebook]=="true"
      @fb_friends = FbGraph2::User.me(current_user.oauth_token).friends
      @users = User.find_facebook_friends(current_user, @fb_friends.map{|friend|friend.id})

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
INSERT INTO "friendships" ("user_id", "friend_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 8], ["friend_id", 5], ["created_at", 2016-11-19 05:53:45 UTC], ["updated_at", 2016-11-19 05:53:45 UTC]]
---
  def create
    @friend = User.find(params[:friend_id])
    if @friend.nil?
      flash[:error] = "Cannot find the user, please check again"
      render 'new'
      return
    end

    @friendship = Friendship.new(user_id:current_user.id, friend_id: @friend.id)
    if @friendship.save

INSERT INTO "friendships" ("user_id", "friend_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 5], ["friend_id", 6], ["created_at", 2016-11-19 07:34:39 UTC], ["updated_at", 2016-11-19 07:34:39 UTC]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
---
  def accept_friend

      @friendship = Friendship.new(user_id:current_user.id, friend_id:params[:friend_id])
      if @friendship.save
        flash[:success] = "You are now friend with " + User.find(params[:friend_id]).display_name