src/app/controllers/messages_controller.rb

def index
  @conversation= Conversation.find(params[:conversation_id])
 @messages = @conversation.messages
  if @messages.length > 10
---
SELECT  "conversations".* FROM "conversations" WHERE "conversations"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "messages".* FROM "messages" WHERE "messages"."conversation_id" = $1  [["conversation_id", 1]]

def create
 @message = @conversation.messages.new(message_params)
 if @message.save
---
INSERT INTO "messages" ("body", "user_id", "created_at", "updated_at", "conversation_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["body", "hello"], ["user_id", 2], ["created_at", 2016-11-15 09:22:08 UTC], ["updated_at", 2016-11-15 09:22:08 UTC], ["conversation_id", 1]]