src/app/controllers/questions_controller.rb

INSERT INTO "questions" ("title", "content", "rating", "location", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["title", "test question"], ["content", "content"], ["rating", 4], ["location", "somewhere"], ["user_id", 1], ["created_at", 2016-11-20 08:57:09 UTC], ["updated_at", 2016-11-20 08:57:09 UTC]]
---
  def create
    @question = Question.new(question_params)

    respond_to do |format|
      if @question.save

UPDATE "questions" SET "rating" = $1, "user_id" = $2, "updated_at" = $3 WHERE "questions"."id" = $4  [["rating", 5], ["user_id", 2], ["updated_at", 2016-11-20 09:32:16 UTC], ["id", 1]]
---
  def update
    respond_to do |format|
      if @question.update(question_params)