src/app/views/users/show.html.erb

SELECT "friendships".* FROM "friendships" WHERE "friendships"."user_id" = $1  [["user_id", 7]]
---
      <div class="card card-outline-primary user-card">
        <% if @user.friendships.length > 0 %>